// 30. Вывести на экран таблицу квадратов чисел от 1 до N

int n=10;
for (int i=1; i<=n; i++)
    {
    System.Console.WriteLine(i+" "+i*i);
    }